app/controllers/tasks_controller.rb

SELECT * FROM "tasks" WHERE ("tasks"."done" = 'f')
---
  def index
    @tasks = Task.find_all_by_done(false)

INSERT INTO "tasks" ("updated_at", "done", "description", "user_id", "created_at") VALUES('2009-10-28 10:48:18', 'f', 'teste', 1, '2009-10-28 10:48:18')
---
  def create
    @task = Task.new(params[:task])

    render :update do |page|
      if @task.save

SELECT * FROM "tasks" WHERE ("tasks"."id" = 89)
UPDATE "tasks" SET "description" = 'New Task', "updated_at" = '2009-10-24 10:44:39' WHERE "id" = 89
---
  def update
    @task = Task.find(params[:id])

    render :update do |page|
      page.visual_effect :fade, "task_#{@task.id}" if @task.update_attributes(params[:task])

SELECT * FROM "tasks" WHERE ("tasks"."id" = 2053932785)
DELETE FROM "tasks" WHERE "id" = 2053932785
---
  def destroy
    @task = Task.find(params[:id])
    @task.destroy