app/controllers/users_controller.rb

  def create
    logout_keeping_session!

    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('dd5c7f58a0954006eee6b5e14aca3555c35b59a1', '2009-10-22 08:21:07', '4a6d890a826aa007a29f173acf3613849941fe5d', NULL, NULL, 'elomarns', NULL, '2009-10-22 08:21:07')

  def home
    @tasks = current_user.tasks.find_all_by_done(false)
---
SELECT * FROM "tasks" WHERE ("tasks"."done" = 'f') AND ("tasks".user_id = 1)